#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <conio.h>
#include <Windows.h>
#include "function.h"
#include "struct.h"
#include "util.h"

void help() {
	system("cls");
	printf("======================================================================================================\n");
	printf("                ___   _  _______    _______  ___  __    _  _______  __   __  _______\n");
	printf("               |   | | ||  _    |  |       ||   ||  |  | ||       ||  |_|  ||   _   |\n");
	printf("               |   |_| || |_|   |  |       ||   ||   |_| ||    ___||       ||  |_|  |\n");
	printf("               |      _||       |  |       ||   ||       ||   |___ |       ||       |\n");
	printf("               |     |_ |  _   |   |      _||   ||  _    ||    ___||       ||       |\n");
	printf("               |    _  || |_|   |  |     |_ |   || | |   ||   |___ | ||_|| ||   _   |\n");
	printf("               |___| |_||_______|  |_______||___||_|  |__||_______||_|   |_||__| |__|\n");
	printf("\n");
	printf("======================================================================================================\n");
	printf("\n\n");
	printf("                                               도움말\n");
	printf("\n\n");
	printf("                  ┌────────────────────────────────────────────────────────────────┐\n");
	printf("                  │                                                                │\n");
	printf("                  │  1. 빠른 예매: 영화 및 좌석 선택, 결제까지 한 번에 진행합니다. │\n");
	printf("                  │                                                                │\n");
	printf("                  │  2. 예매 내역 조회: 예매 내역을 확인할 수 있습니다.            │\n");
	printf("                  │                                                                │\n");
	printf("                  │  3. 영화 추천받기: 고객님의 선호 장르를 분석해 현재 상영작 중  │\n");
	printf("	          │                    취향에 맞는 영화를 추천해드립니다.          │\n");
	printf("                  │                                                                │\n");
	printf("                  │  4. 장르로 검색: 현재 상영작을 장르별로 조회할 수 있습니다.    │\n");
	printf("                  │                                                                │\n");
	printf("                  │  5. 관리자 메뉴: 현재 상영작 및 영화 추천 기능용 DB, 예매 내역 │\n");
	printf("                  │                  등을 관리할 수 있습니다.                      │\n");
	printf("                  │                                                                │\n");
	printf("                  │  6. 종료: 프로그램을 종료합니다.                               │\n");
	printf("                  │                                                                │\n");
	printf("                  └────────────────────────────────────────────────────────────────┘\n");
	printf("\n\n");
	printf("                                     아무 키나 누르면 돌아갑니다.");
	_getch();
	return;
}